---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetInputReferences
source: html/64f39922-a906-19ae-bfa0-0642910eefdb.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetInputReferences Method

Gets references of input elements.

## Syntax (C#)
```csharp
public IList<Reference> GetInputReferences()
```